<template>
	<el-button type="primary" :disabled="copyBtnDisabled" @click="handleCopy">Copy [{{ start }},{{ end }}] 行</el-button>

	<div id="content" style="font-size: 24px;">
		<p>一旦他的头颅离开了自己的尸体，那么他的力量就会完全消失，镇压的恶灵也会再一次出现！</p>
		<p> 当年，阮开黄倒是将这点记得死死，所以，到他死之前，他都没有让其他人接近过这座神庙，僧人的头颅也从不曾离开自己的身体。</p>
		<p> 那段时间大概是村子里为数不多的安宁时光。</p>
		<p> 然而，这样的时光到了阮开黄的儿子接受村长之位后……便结束了</p>
		<p> 他缺乏威信，也感受到了村民们对他的不信任。</p>
		<p> 当年他爹做的事，其实村里很多人都知道，毕竟他们自己也是参与者，只不过畏惧阮开黄的手段，再加上自己内心的愧疚，无法面对过去，所以根本没有人再提起这件事……</p>
		<p> 等到阮开黄死后，他的儿子阮鑫接替村长职位，才是祈雨村噩梦真正的开始！</p>
		<p> 阮鑫为了镇住村民，保住自己的村长之位，他竟独自去到了村子的后山神庙，摘下了僧人的头颅！</p>
		<p> 这一下，村子里又出事了……</p>
		<p> 随着接二连三的死人，阮鑫终于意识到自己闯下了大祸！</p>
		<p> 他惶恐地上山，想要再将僧人的头颅接回去，然而当他再一次来到神庙之中时，恐怖的事情发生了……</p>
		<p> 阮鑫看见，原本应该在神庙中央坐着的僧人身体……竟然不见了！</p>
		<p> 这下，他彻底慌了！</p>
		<p> 原本，阮鑫只是想通过这样的方式来报复一下村民，让他们感受一下恐惧，好让他们回忆起，是自己的父亲带给了他们安宁。</p>
		<p> 可谁曾想到，这事儿一出就没法收了！</p>
		<p> 急坏了的阮鑫，立刻找上了一名村民，模仿着自己父亲的样子，让他拿着钱财前往那座庙宇里再去寻求帮助。</p>
		<p> 然而这一次……却失败了。</p>
		<p> 几十年过去，那座庙宇早就已经没有了香火供应，僧人们死的死，走的走，等村民到达了那座庙宇之后才发现，那里早已经成了一座空庙！</p>
		<p> 那名村民怀揣着绝望的心情回到了祈雨村，村子里依旧继续发生着可怕的事情，在最终万般无奈之下，村民们已经做好了最坏的打算，准备搬离这座生他们，养他们的村子。</p>
		<p> 如果不是没有办法，没有人愿意背井离乡。</p>
		<p> 尤其是他们还没有什么钱。</p>
		<p> 也就是在这样的情况下，村子里出现了转机。</p>
		<p> 一个女人，出现了。</p>
		<p> 她先是向村子里的人询问了这里的情况，在了解清楚之后，竟然破天荒告诉阮鑫，她可以免费帮助阮鑫解决村子里的问题，但前提是……阮鑫要娶她过门。</p>
		<p> 当然具体原因，阮鑫也不清楚。</p>
		<p> 当然，那个时候，阮鑫哪里还有选择的权利？</p>
		<p> 他不愿意放弃自己手上的权力，所以只能同意，姑且死马当活马医，看看这个女人到底有什么本事？</p>
		<p> 他没想到，娶了这个女人，过门不久，村子里竟然真的……安宁了。</p>
		<p> 可惜好景不长，没过两年，女人死了。</p>
		<p> 死于难产。</p>
		<p> 但是孩子却奇迹般地活了下来。</p>
		<p> 是个女孩儿。</p>
		<p> 这个女孩，也就是现在的神婆。</p>
		<p> 她从小就很聪明，一直在研究母亲留给她的那些遗物，也从父亲的嘴里详细地得知了当年发生的事情。</p>
		<p> 十一年后，阮鑫死于心脏病，神婆继位。</p>
		<p> 这个时候，她已经在村庄里有了相当的威信。</p>
		<p> 但她继位之后，相比起自己的父亲更加变本加厉，不但放出各种谣言造谣，当年发生的事，污蔑死者，还大肆地逼迫村民们，上交财务粮食去兴建各种庙宇，其实最后这些财物，多是流入了她自己的囊中！</p>
		<p> 可即便如此，还是会有村民不时地离奇死亡。</p>
		<p> 眼看着村庄的村民人口逐渐稀疏，神婆知道不能再这么下去了。</p>
		<p> 于是，她想了个法子，这个法子……就是让外面的人代替村民成为祭品！</p>
		<p> 这样，就能够暂时平息死者的怨气。</p>
		<p> 从那一年开始，村庄便不停地兴建旅游业，他们花费了大量的精力财力去打造景点，并且在每年需要献祭的时候，对外开放参观！</p>
		<p> 不得不说，这个法子实在是很好用。</p>
		<p> 从旅游业开始兴起之后……村子，就再也没有死过人了。</p>
		<p> 哦，当然，他们并不称呼外面那些前来参观的游客为人。</p>
		<p> 他们称他们为……祭品。</p>
		<p> 这，就是祈雨村的全部真相。</p>
		<p> “这些人可真是活畜牲！”</p>
		<p> “从上到下，从前往后没一个好东西！”</p>
		<p> 刘承峰骂地厉害，双目通红。</p>
		<p> 他似乎觉得不解气，跑上去就给了神婆那团肉球狠狠一脚，直接将肉球踢散。落了一地的碎肉和碎骨。</p>
		<p> 浓郁的血腥味弥漫，二人觉得不舒服，便拿着书往回走。</p>
		<p> “这个方法且不说是否伤天害理……本身就是饮鸩止渴。”</p>
		<p> 宁秋水叹了口气。</p>
		<p> “试想村子里枉死的人越来越多，怨气也只会越来越大，到了某一天，终于绷不住的时候，就会全部反馈给这些村民！”</p>
		<p> “还记得白姐说的话吗，那个神婆已经开始遭到反噬了……”</p>
		<p> 刘承峰想了想之前他们在第一扇血门背后遇见的那个红衣女鬼，忍不住打了个寒颤！</p>
		<p> 怪不得会诞生那样可怕的厉鬼，屠戮一个地方还不够，还要跑到其他的地方去继续大肆杀戮！</p>
		<p> “咱们在第一扇血门背后遇见的那个红衣女鬼，应该是融合了祈雨村几十人甚至上百人百年来的怨气！”</p>
		<p> “也难怪它会那么凶残，将整个别墅区的人全部杀了个干净！”</p>
		<p> “他奶奶的，知道了这些杂种这所作所为，我都不想救他们了！”</p>
		<p> 宁秋水说道:</p>
		<p> “本来我们也不是要救他们，咱们现在得先想办法先把白姐救下来，然后再帮僧人找到他的头颅，我现在估计广修和这些枉死之人的怨气只有僧人才能够压制了，但现在那个僧人没有头颅，他也无能为力。”</p>
	</div>

</template>
<script setup>
import { useClipboard } from '@vueuse/core'
import { ElMessage } from 'element-plus'
import { ref } from 'vue';

const { copy } = useClipboard()

// 每次读取行数
const rowCount = 500
// 开始行
const start = ref(0)
// 结束行
const end = ref(rowCount)

// copy按钮是否禁用
const copyBtnDisabled = ref(false)

// 循环复制行
const handleCopy = () => {
	const ps = document.getElementById('content').children
	let i = start.value
	let content = ''
	while (i < end.value && ps[i]) {
		content += ps[i].innerText + '\n'
		i++
	}

	copy(content).then(() => {
		ElMessage.success('复制成功')

		if (end.value >= ps.length) {
			copyBtnDisabled.value = true
		} else {
			// 更改开始行、结束行
			start.value = end.value
			end.value += rowCount
		}
	})
}
</script>